In [112]:
import pandas as pd
import analysis_functs as funct
import numpy as np
import yfinance as yf

start_date = "2023-11-16" # hard coded dates for analysis
end_date = "2024-11-16"

portf = pd.read_csv("simple_portf.csv")

In [113]:
portf

  TICKER  QUANTITY
0    JPM        10
1   GOOG        10
2   AMZN        10
3   STLA        10

In [114]:
retdf = pd.DataFrame()

In [115]:
for tickers in portf.iloc[:,0]: # get price data for each stock in the original portf dataframe and also their normalized returns
    retdf[tickers] = (yf.download(tickers, start=start_date, end=end_date, interval="5d")['Adj Close'])
    retdf[tickers + " Normalized Return"] = retdf[tickers]/retdf.iloc[0][tickers]

[*********************100%***********************]  1 of 1 completed

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

In [116]:
og_alloc = []
for ticker in portf.iloc[:,0]:
    og_alloc.append(retdf.iloc[0][ticker])

In [117]:
portf["ORIGINAL_VALUE"] = portf["QUANTITY"]*og_alloc
portf

  TICKER  QUANTITY  ORIGINAL_VALUE
0    JPM        10     1479.178162
1   GOOG        10     1382.034149
2   AMZN        10     1428.300018
3   STLA        10      186.430168

In [118]:
portf["ALLOCATION"] = portf["ORIGINAL_VALUE"]/sum(portf["ORIGINAL_VALUE"])
portf

  TICKER  QUANTITY  ORIGINAL_VALUE  ALLOCATION
0    JPM        10     1479.178162    0.330473
1   GOOG        10     1382.034149    0.308769
2   AMZN        10     1428.300018    0.319106
3   STLA        10      186.430168    0.041652

In [119]:
sum(portf["ORIGINAL_VALUE"])

4475.942497253418

In [39]:
retdf.head()

,JPM,JPM Normalized Return,GOOG,GOOG Normalized Return,AMZN,AMZN Normalized Return,STLA,STLA Normalized Return
Date,,,,,,,,
2023-11-16,147.917816,1.000000,138.203415,1.000000,142.830002,1.000000,18.643017,1.000000
2023-11-21,149.402374,1.010036,138.123703,0.999423,143.899994,1.007491,18.886351,1.013052
2023-12-01,153.182114,1.035589,132.842697,0.961211,147.029999,1.029406,20.599037,1.104920
2023-12-06,152.664474,1.032090,130.959427,0.947585,144.520004,1.011832,21.095060,1.131526
2023-12-11,155.389420,1.050512,134.217728,0.971161,145.889999,1.021424,21.095060,1.131526

In [60]:
retdf.iloc[0]

JPM                       147.917816
JPM Normalized Return       1.000000
GOOG                      138.203415
GOOG Normalized Return      1.000000
AMZN                      142.830002
AMZN Normalized Return      1.000000
STLA                       18.643017
STLA Normalized Return      1.000000
Name: 2023-11-16 00:00:00, dtype: float64

In [72]:
for ticker in portf.iloc[:,0]:
    retdf.iloc[0][ticker]

In [79]:
og_alloc = []
for ticker in portf.iloc[:,0]:
    og_alloc.append(retdf.iloc[0][ticker])

In [80]:
og_alloc

[np.float64(147.91781616210938),
 np.float64(138.2034149169922),
 np.float64(142.8300018310547),
 np.float64(18.643016815185547)]